# 허민석님 인프런 강의 일지
https://github.com/minsuk-heo 깃허브 참고

In [39]:
import pandas as pd

In [3]:
data_frame = pd.read_csv('C:/Users/김나영/Desktop/데잇걸즈/2020.09.15 판다스 기초/friend_list.csv')

In [4]:
data_frame

   name  age       job
0  luna   25   student
1    jk   24   student
2  john   27  engineer
3   kay   23   teacher

In [10]:
type(data_frame.name)

pandas.core.series.Series

## data frame 만들기

In [68]:
#series만들어서
s1= pd.core.series.Series(['one','two','three'])
s2= pd.core.series.Series([1,2,3])
pd.DataFrame(data=dict(num=s2, word=s1))

   num   word
0    1    one
1    2    two
2    3  three

In [17]:
#data frame 가져오기

In [20]:
#csv파일(쉼표로 구분)
df = pd.read_csv('C:/Users/김나영/Desktop/데잇걸즈/2020.09.15 판다스 기초/friend_list.csv')
df

   name  age       job
0  luna   25   student
1    jk   24   student
2  john   27  engineer
3   kay   23   teacher

In [21]:
#data frame생성

In [23]:
friend_dict_list = [
    {'name': 'Nayoung','age':25,'job':'data analyst'},
    {'name': 'JK','age':24,'job':'developer'}
]

In [26]:
df = pd.DataFrame(friend_dict_list)
df

      name  age           job
0  Nayoung   25  data analyst
1       JK   24     developer

In [30]:
df = df[['name','job','age']] #컬럼 순서 바꾸기
df

      name           job  age
0  Nayoung  data analyst   25
1       JK     developer   24

In [50]:
#키 순서 보장(위의 dataframe은 순서 바뀔 수 있어 다시 설정해줘야함)
from collections import OrderedDict

In [76]:
friend_ordered_dict = OrderedDict(
[
    ('name',['Nayoung','JK']),
    ('age',[25,24]),
    ('job',['data analyst','developer'])
])

In [77]:
df = pd.DataFrame.from_dict(friend_ordered_dict)
df

      name  age           job
0  Nayoung   25  data analyst
1       JK   24     developer

In [78]:
friend_list = [
    ['Nayoung',25,'Data analyst'],
    ['JK',24,'Developed'],
    ['Jenny',25,'idol']
]
column_name = ['name','age','job']

In [79]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)
df

      name  age           job
0  Nayoung   25  Data analyst
1       JK   24     Developed
2    Jenny   25          idol

In [71]:
friend_list = [
    ['name',['Nayoung','JK']],
    ['age',[25,24]],
    ['job',['data analyst','developer']]
]
df = pd.DataFrame.from_items(friend_list)
df

AttributeError: type object 'DataFrame' has no attribute 'from_items'

## 데이터 프레임에서 원하는 값 뽑기

In [64]:
df

      name  age           job
0  Nayoung   25  Data analyst
1       JK   24     Developed
2    Jenny   25          idol

In [66]:
#index 0,2만 가져오기
df.loc[[0,2]]

      name  age           job
0  Nayoung   25  Data analyst
2    Jenny   25          idol

In [67]:
#컬럼 조건에 따라 고르기
df[(df.age>24) & (df.name == 'Nayoung')]

      name  age           job
0  Nayoung   25  Data analyst

In [82]:
df.iloc[0:2,0:2]

      name  age
0  Nayoung   25
1       JK   24

In [84]:
#첫번째 줄이 b가 들어있는 것만 가져오기
df.filter(regex='b$', axis=1)

            job
0  Data analyst
1     Developed
2          idol

## 데이터 프레임 행, 열 삭제하기

In [68]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

### 열 삭제

In [69]:
df.drop('age', axis=1)

    name        job
0   Jone    student
1  Jenny  developer
2   Nate    teacher

### 특정 행 삭제

inplace: 데이터 프레임에 바로 적용

여기서 df.drop('Jone','Nate')가 안된 이유는 데이터 프레임에 인덱스가 있어서 인덱스를 기준으로 행을 삭제하기 때문인듯!

In [70]:
indexnames = df[(df['name'] == 'Jone') | (df['name'] == 'Nate')].index
df.drop(indexnames, inplace=True)
print(df)

    name  age        job
1  Jenny   30  developer

In [71]:
df.set_index('name',append=True, inplace=True)
df

         age        job
  name
1 Jenny   30  developer

In [74]:
#index를 이름으로 설정해주면 정상 작동!

df2 = pd.DataFrame(friend_dict_list, index=['Jone','Jenny','Nate'])

df2.drop(['Jone','Nate'])

        name  age        job
Jenny  Jenny   30  developer

### 인덱스로 삭제하기

In [124]:
df.drop(df.index[[0,2]])

    name  age        job
1  Jenny   30  developer

### 조건 주기

In [126]:
df[df.age > 20]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [128]:
df.drop('age',axis=1)

    name        job
0   Jone    student
1  Jenny  developer
2   Nate    teacher

## 행열 생성 및 수정하기

In [130]:
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

### 새로운 컬럼 삽입

In [133]:
df['salary'] = 0
df

    name  age        job  salary
0   Jone   20    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [134]:
import numpy as np

In [135]:
df['salary'] = np.where(df['job'] != 'student', 'yes','no')
df

    name  age        job salary
0   Jone   20    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [164]:
#새로운 df만들기
friend_dict_list = [{'name':'John', 'midterm':95, 'final':85},
                   {'name':'Jenny', 'midterm':75, 'final':95},
                   {'name':'Jongki', 'midterm':65, 'final':100}]
df = pd.DataFrame(friend_dict_list, columns={'name','midterm','final'})
df

   midterm    name  final
0       95    John     85
1       75   Jenny     95
2       65  Jongki    100

In [165]:
#합계 컬럼 추가
df['total'] = df['midterm'] + df['final']
df

   midterm    name  final  total
0       95    John     85    180
1       75   Jenny     95    170
2       65  Jongki    100    165

In [166]:
#평균 컬럼 추가
df['average'] = df['total']/2
df

   midterm    name  final  total  average
0       95    John     85    180     90.0
1       75   Jenny     95    170     85.0
2       65  Jongki    100    165     82.5

In [167]:
#조건에 맞는 값 반환하는 컬럼 추가
grades = []
for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 85:
        grades.append('B')
    else:
        grades.append('F')

df['grade'] = grades
df

   midterm    name  final  total  average grade
0       95    John     85    180     90.0     A
1       75   Jenny     95    170     85.0     B
2       65  Jongki    100    165     82.5     F

In [168]:
def pass_or_fail(row):
    if row != 'F':
        return "Pass"
    else: 
        return "Fail"

In [169]:
df.grade = df.grade.apply(pass_or_fail)
df

   midterm    name  final  total  average grade
0       95    John     85    180     90.0  Pass
1       75   Jenny     95    170     85.0  Pass
2       65  Jongki    100    165     82.5  Fail

In [170]:
date_list = [
    {
        'yyyy-mm-dd':'2000-06-27'
    },
     {
        'yyyy-mm-dd':'2000-11-27'
    }
]
df3 = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df3

   yyyy-mm-dd
0  2000-06-27
1  2000-11-27

In [171]:
def extract_year(row):
    return row.split('-')[0] #-로 나눈 것의 첫번째 인자

In [173]:
df3['year'] = df3['yyyy-mm-dd'].apply(extract_year)
df3

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2000-11-27  2000

### 새로운 행 삽입

In [174]:
df2 = pd.DataFrame([['Ben',50,30]], columns = ['name','midterm','final'])
df2

  name  midterm  final
0  Ben       50     30

In [175]:
df.append(df2, ignore_index=True)

   midterm    name  final  total  average grade
0       95    John     85  180.0     90.0  Pass
1       75   Jenny     95  170.0     85.0  Pass
2       65  Jongki    100  165.0     82.5  Fail
3       50     Ben     30    NaN      NaN   NaN

## 데이터 그룹 만들기

### 데이터 셋 만들기

In [81]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': None}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       John  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology    None

In [5]:
groupby_major = df.groupby("major")

In [9]:
groupby_major.groups #어떤 그룹이 있나

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [10]:
for name, group in groupby_major:
    print(name + " : " + str(len(group))) #group별 인원 수 
    print(group)
    print()

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [16]:
#학과별 인원수 데이터 프레임으로 바꾸기
df_major_cnt = pd.DataFrame({'count': groupby_major.size()}).reset_index() #size는 원소의 개수 반환, reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

#### ※reset_index()를 하는 이유
reset_index 명령으로 인덱스를 보통의 자료열로 바꿀 수도 있다. 이 때 인덱스 열은 자료열의 가장 선두로 삽입된다. 데이터프레임의 인덱스는 정수로 된 디폴트 인덱스로 바뀐다.

In [21]:
groupby_sex = df.groupby("sex")
groupby_sex.groups

{'female': Int64Index([4, 5, 6, 8, 9, 10], dtype='int64'),
 'male': Int64Index([0, 1, 2, 3, 7], dtype='int64')}

In [27]:
for name,sex in groupby_sex:
    print(name + " : " + str(len(group))) #group별 인원 수 
    print(group)
    print()

female : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

male : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

## 중복 행 제거

In [31]:
df.duplicated() #중복값 확인

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [32]:
df.drop_duplicates() #중복값 제거

        name             major     sex
0       John  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

## NaN을 찾고 원하는 값으로 변경하기

In [142]:
friend_dict_list = [{'name':'John', 'midterm':None, 'final':85, 'classroom':'1'},
                   {'name':'Jenny', 'midterm':75, 'final':95, 'classroom':'2'},
                   {'name':'Jongki', 'midterm':45, 'final':100, 'classroom':'1'},
                   {'name':'Nayoung', 'midterm': 80, 'final':100, 'classroom':'2'}]
df = pd.DataFrame(friend_dict_list, columns={'name','midterm','final','classroom'})
df

   midterm classroom     name  final
0      NaN         1     John     85
1     75.0         2    Jenny     95
2     45.0         1   Jongki    100
3     80.0         2  Nayoung    100

In [143]:
df.isna()

   midterm  classroom   name  final
0     True      False  False  False
1    False      False  False  False
2    False      False  False  False
3    False      False  False  False

In [144]:
df.isnull()

   midterm  classroom   name  final
0     True      False  False  False
1    False      False  False  False
2    False      False  False  False
3    False      False  False  False

### 결측값 변경

In [94]:
df.midterm = df.midterm.fillna(0) #NaN값은 0으로 변경
df

   midterm    name  final
0      0.0    John     85
1     75.0   Jenny     95
2      0.0  Jongki    100

In [140]:
df["midterm"].fillna(df.groupby("classroom")["midterm"].transform("median"), inplace=True)

In [141]:
df

   midterm classroom     name  final
0     45.0         1     John     85
1     75.0         2    Jenny     95
2     45.0         1   Jongki    100
3     80.0         2  Nayoung    100

## apply function-커스텀 함수 적용

In [148]:
date_list = [
    {'yyyy-mm-dd':'2002-10-19'},
    {'yyyy-mm-dd':'1996-11-27'},
    {'yyyy-mm-dd':'2010-11-11'}
]

df=pd.DataFrame(date_list, columns=['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2002-10-19
1  1996-11-27
2  2010-11-11

In [149]:
#year뽑는 함수 만들기
def extract_year(column):
    return column.split('-')[0]

In [153]:
#extract_year 함수 적용
df['year'] = df['yyyy-mm-dd'].apply(extract_year) 
df

   yyyy-mm-dd  year
0  2002-10-19  2002
1  1996-11-27  1996
2  2010-11-11  2010

In [155]:
#나이 계산하는 함수 만들기
def get_age(year,current_year):
    age = current_year - int(year) +1
    return age

In [158]:
#get_age 적용
df['age']=df['year'].apply(get_age, current_year=2020)
df

   yyyy-mm-dd  year  age
0  2002-10-19  2002   19
1  1996-11-27  1996   25
2  2010-11-11  2010   11

In [159]:
#함수 만들기
def get_introduce(age,prefix,suffix):
    return prefix+ str(age) + suffix

In [162]:
#함수 적용
df['introduce'] = df['age'].apply(get_introduce, prefix = '안뇽! 나는 ', suffix='살 이얌')
df

   yyyy-mm-dd  year  age      introduce
0  2002-10-19  2002   19  안뇽! 나는 19살 이얌
1  1996-11-27  1996   25  안뇽! 나는 25살 이얌
2  2010-11-11  2010   11  안뇽! 나는 11살 이얌

### 여러개의 funtion을 apply

In [167]:
#함수 만들기
def get_introduce_2(row):
    return "I was born in " + "str(row.year)" + " my age is " + str(row.age)

### axis=1의 의미

axis=1 가로로 index0 부터 순차적으로 접근

https://m.blog.naver.com/PostView.nhn?blogId=tjdrud1323&logNo=221452985303&proxyReferer=https:%2F%2Fwww.google.com%2F

In [172]:
#함수 적용
df.introduce = df.apply(get_introduce_2, axis=1)
df

   yyyy-mm-dd  year  age                                 introduce
0  2002-10-19  2002   19  I was born in str(row.year) my age is 19
1  1996-11-27  1996   25  I was born in str(row.year) my age is 25
2  2010-11-11  2010   11  I was born in str(row.year) my age is 11

## map, applymap 다양한 활용 방법

In [173]:
date_list = [
    {'yyyy-mm-dd':'2002-10-19'},
    {'yyyy-mm-dd':'1996-11-27'},
    {'yyyy-mm-dd':'2010-11-11'}
]

df=pd.DataFrame(date_list, columns=['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2002-10-19
1  1996-11-27
2  2010-11-11

In [186]:
#year뽑는 함수 만들기
def extract_year(column):
    return column.split('-')[0]


df['year'] = df['yyyy-mm-dd'].map(extract_year) 
df

   yyyy-mm-dd  year
0  2002-10-19  2002
1  1996-11-27  1996
2  2010-11-11  2010

### map

map은 apply와 똑같이 쓰이지만 '텍스트를 숫자로 바꿔야할 때'는 더 유용

In [187]:
student_list = [
    {'age':20, 'job':'student'},
    {'age':30, 'job':'teacher'},
    {'age':25, 'job':'developer'}
]

df=pd.DataFrame(student_list, columns=['age','job'])
df

   age        job
0   20    student
1   30    teacher
2   25  developer

In [188]:
df.job = df.job.map({'student':1,'teacher':2,'developer':3})
df

   age  job
0   20    1
1   30    2
2   25    3

### applymap

모든 값에 적용하고 싶을 때

In [203]:
import numpy as np

In [191]:
df = df.applymap(np.around)

In [192]:
df

   age  job
0   20    1
1   30    2
2   25    3

## unique한 value만 뽑아내기

In [199]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])

In [200]:
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [201]:
df.job.unique() #job 구성요소

array(['teacher', 'student', 'developer', 'dentist', 'lawyer', 'banker',
       'basketball player'], dtype=object)

In [205]:
df.job.value_counts() #job별 개수

teacher              8
student              5
banker               2
lawyer               2
basketball player    1
dentist              1
developer            1
Name: job, dtype: int64

## 두개의 데이터 프레임 합치기

### 행으로 합치기

In [209]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [210]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [211]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

In [208]:
result = pd.concat([df1,df2])
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [212]:
result = pd.concat([df1,df2], ignore_index=True) #인덱스 다시
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [215]:
result = df1.append(df2, ignore_index = True)
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

### 열로 합치기

In [216]:

l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l2 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['age', 'country'])

In [217]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [218]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [221]:
result = pd.concat([df1,df2],axis=1, ignore_index=True)
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

In [222]:
label = [1,2,3,4,5]
prediction = [1,2,3,4,4]

In [225]:
comparison = pd.DataFrame({'label':label, 'prediction':prediction})
comparison

   label  prediction
0      1           1
1      2           2
2      3           3
3      4           4
4      5           4